ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32/src/Main.cpp
      if(basic_state_send_b)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_basic_st,sizeof(dap_state_basic_st));
        basic_state_send_b=false;
      }
      if(extend_state_send_b)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_extended_st, sizeof(dap_state_extended_st));
        extend_state_send_b=false;
      }
      if(ESPNow_config_request)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_config_st,sizeof(dap_config_st));
        ESPNow_config_request=false;
      }
      if(ESPNow_OTA_enable)
      {
        Serial.println("Get OTA command");
        OTA_enable_b=true;
        OTA_enable_start=true;
        ESPNow_OTA_enable=false;
      }
          
      //rudder sync
      if(dap_calculationVariables_st.Rudder_status)
      {              
        dap_calculationVariables_st.current_pedal_position_ratio=((float)(dap_calculationVariables_st.current_pedal_position-dap_calculationVariables_st.stepperPosMin_default))/((float)dap_calculationVariables_st.stepperPosRange_default);
        _ESPNow_Send.pedal_position_ratio=dap_calculationVariables_st.current_pedal_position_ratio;
        _ESPNow_Send.pedal_position=dap_calculationVariables_st.current_pedal_position;
        //ESPNow_send=dap_calculationVariables_st.current_pedal_position; 
        esp_err_t result =ESPNow.send_message(Recv_mac,(uint8_t *) &_ESPNow_Send,sizeof(_ESPNow_Send));                
        //if (result == ESP_OK) 
        //{
        //  Serial.println("Error sending the data");
        //}                
        if(ESPNow_update)
        {
          //dap_calculationVariables_st.sync_pedal_position=ESPNow_recieve;
          dap_calculationVariables_st.sync_pedal_position=_ESPNow_Recv.pedal_position;
          dap_calculationVariables_st.Sync_pedal_position_ratio=_ESPNow_Recv.pedal_position_ratio;
          ESPNow_update=false;
        }                
      }
          
    }

    #ifdef ESPNow_debug_rudder
      if(print_count>1000)
      {
        if(dap_calculationVariables_st.Rudder_status)
        {
          Serial.print("Pedal:");
          Serial.print(dap_config_st.payLoadPedalConfig_.pedal_type);
          Serial.print(", Send %: ");
          Serial.print(_ESPNow_Send.pedal_position_ratio);
          Serial.print(", Recieve %:");
          Serial.print(_ESPNow_Recv.pedal_position_ratio);
          Serial.print(", Send Position: ");
          Serial.print(dap_calculationVariables_st.current_pedal_position);
          Serial.print(", % in cal: ");
          Serial.print(dap_calculationVariables_st.current_pedal_position_ratio); 
          Serial.print(", min cal: ");
          Serial.print(dap_calculationVariables_st.stepperPosMin_default); 
          Serial.print(", max cal: ");
          Serial.print(dap_calculationVariables_st.stepperPosMax_default);
          Serial.print(", range in cal: ");
          Serial.println(dap_calculationVariables_st.stepperPosRange_default); 
        }

        //Debug_rudder_last=now_rudder;
        //Serial.println(dap_calculationVariables_st.current_pedal_position);                  
            
        print_count=0;
      }
      else
      {
        print_count++;
            
      } 
          
               
    #endif



  }

}
#endif


